tutorials/modules/multiRegion/CHT/circuitBoardCooling/Allrun-extrudeFromPatches
#!/bin/sh
cd ${0%/*} || exit 1 # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh -region fluid

# Create the 3D baffle
runApplication -s extrudeFromPatches createBaffles -region fluid -overwrite \
    -dict system/fluid/createBafflesDict.extrudeFromPatches
runApplication extrudeToRegionMesh -region fluid -overwrite \
    -dict system/fluid/extrudeToRegionMeshDict.extrudeFromPatches

# Create the 1D baffle
runApplication createBaffles -region fluid -overwrite

runApplication $(getApplication)

paraFoam -touchAll

#------------------------------------------------------------------------------
